---
kind: type
id: T:Autodesk.Revit.DB.TransmittedModelOptions
source: html/d856a44d-2b55-d088-81b6-ddef46994c52.htm
---
# Autodesk.Revit.DB.TransmittedModelOptions

Enum giving desired behavior when opening or saving a transmitted
 workshared model.

## Syntax (C#)
```csharp
public enum TransmittedModelOptions
```